Repository: the-very-pulse-of-that-machine/iLoveTrans
Catalog: libretranslate_totally_local/locales/*/LC_MESSAGES/messages.po
Languages: hu, sr

source: Invalid JSON format
hu: Érvénytelen JSON formátum
sr: Nevažeći JSON format

source: Auto Detect
hu: Automatikus felismerés
sr: Auto Detekcija

source: Unauthorized
hu: Nincs jogosultsága
sr: Neovlašćeno

source: Too many request limits violations
hu: Túl sok kérelem korlátozza a jogsértéseket
sr: Previše zahteva i kršenja ograničenja

source: Invalid API key
hu: Érvénytelen API kulcs
sr: Nevažeći API ključ

source: Please contact the server operator to get an API key
hu: Kérjük, vegye fel a kapcsolatot a szerver-üzemeltetővel, hogy megkapja az API kulcsot
sr: Kontaktirajte operatera servera da dobijete API ključ

source: Visit %(url)s to get an API key
hu: Látogasson el a(z) %(url)s címre, API kulcshoz
sr: Posetite %(url)s da bi ste dobili API lljuč

source: Slowdown:
hu: Lassulás:
sr: Uspori:

source: Invalid request: missing %(name)s parameter
hu: Érvénytelen kérés: hiányzik a(z) %(name)s paraméter
sr: Nevažeći zahtev: nedostaje parametar %(name)s

source: Invalid request: %(name)s parameter is not a number
hu: Érvénytelen kérés: <x>0 0</x> paraméter nem szám %(name)s

source: Invalid request: %(name)s parameter must be <= %(value)s
hu: Érvénytelen kérés: <x>0 0</x> paraméternek &lt;= %(value)s %(name)s

source: Invalid request: request (%(size)s) exceeds text limit (%(limit)s)
hu: Érvénytelen kérés: a kérés mérete (%(size)s) meghaladja a szövegkorlátot (%(limit)s)
sr: Nevažeći zahtev: zahtev (%(size)s) premašuje ograničenje teksta (%(limit)s)

source: %(lang)s is not supported
hu: %(lang)s nyelv nem támogatott
sr: %(lang)s nije podržan

source: %(format)s format is not supported
hu: %(format)s formátum nem támogatott
sr: %(format)s format nije podržan

source: %(tname)s (%(tcode)s) is not available as a target language from %(sname)s (%(scode)s)
hu: %(tname)s (%(tcode)s) nem áll rendelkezésre célnyelvként %(sname)s (%(scode)s)
sr: %(tname)s (%(tcode)s) nije dostupan kao ciljni jezik is %(sname)s (%(scode)s)

source: Cannot translate text: %(text)s
hu: Nem fordítható szöveg: %(text)s
sr: Nije moguće prevesti tekst:%(text)s

source: Files translation are disabled on this server.
hu: Fájlok fordítása kikapcsolva ezen a szerveren.
sr: Prevođenje fajlova je onemogućeno na ovom serveru.

source: Invalid request: empty file
hu: Érvénytelen kérés: üres fájl
sr: Nevažeći zahtev: prazan fajl

source: Invalid request: file format not supported
hu: Érvénytelen kérés: fájlformátum nem támogatott
sr: Nevažeći zahtev: format fajla nije podržan

source: Invalid filename
hu: Érvénytelen fájlnév
sr: Nepostojeće ime fajla

source: Suggestions are disabled on this server.
hu: A javaslatok kikapcsolva ezen a szerveren.
sr: Predlozi su onemogućeni na ovom serveru.

source: English
hu: Angol
sr: Engleski

source: Albanian
hu: Albáni

source: Arabic
hu: Arab
sr: Arapski

source: Azerbaijani
hu: Azerbajdzsán
sr: Azerbejdžanski

source: Bulgarian
hu: Bolgár

source: Catalan
hu: Katalán

source: Chinese
hu: Kínai
sr: Kineski

source: Chinese (traditional)
hu: Kína (hagyományos)

source: Czech
hu: Cseh
sr: Češki

source: Danish
hu: Dán
sr: Danski

source: Dutch
hu: Holland
sr: Holandski

source: Esperanto
hu: Eszperantó

source: Estonian
hu: Észtország

source: Finnish
hu: Finn
sr: Finski

source: French
hu: Francia
sr: Francuski

source: German
hu: Német
sr: Nemački

source: Greek
hu: Görög
sr: Grčki

source: Hebrew
hu: Héber
sr: Hebrejski

source: Hungarian
hu: Magyar
sr: Mađarski

source: Indonesian
hu: Indonéz
sr: Indonežanski

source: Irish
hu: Ír
sr: Irski

source: Italian
hu: Olasz
sr: Italijanski

source: Japanese
hu: Japán
sr: Japanski

source: Korean
hu: Koreai
sr: Korejski

source: Latvian
hu: Lettország

source: Lithuanian
hu: Litvánia

source: Malay
hu: Malajzia

source: Norwegian
hu: Norvégia

source: Persian
hu: Perzsa
sr: Persijski

source: Polish
hu: Lengyel
sr: Poljski

source: Portuguese
hu: Portugál
sr: Portugalski

source: Romanian
hu: Románia

source: Russian
hu: Orosz
sr: Ruski

source: Slovak
hu: Szlovák
sr: Slovacki

source: Slovenian
hu: Szlovén

source: Spanish
hu: Spanyol
sr: Španski

source: Swedish
hu: Svéd
sr: Švedski

source: Turkish
hu: Török
sr: Turski

source: Ukranian
hu: Ukrán
sr: Ukrajinski

source: Urdu
hu: Uram

source: Retrieve list of supported languages
hu: A támogatott nyelvek listájának lekérése
sr: Preuzmite listu podržanih jezika

source: List of languages
hu: A nyelvek listája
sr: Lista jezika

source: translate
hu: fordítás
sr: prevodi

source: Translate text from a language to another
hu: Fordítson szöveget egy nyelvről egy másikra
sr: Prevedite tekst sa jednog jezika na drugi

source: Translated text
hu: Fordított szöveg
sr: Prevedeni tekst

source: Invalid request
hu: Érvénytelen kérés
sr: Nevažeći upit

source: Translation error
hu: Fordítási hiba
sr: Greška u prevodu

source: Slow down
hu: Lassabban
sr: Uspori

source: Banned
hu: Tiltott
sr: Zabranjeno

source: Hello world!
hu: Hello világ!
sr: Zdravo Svete!

source: Text(s) to translate
hu: Lefordítandó szöveg(ek)
sr: Tekst(ovi) za prevod

source: Source language code
hu: Forrás nyelv kódja
sr: Jezik izvornog koda

source: Target language code
hu: Cél nyelv kódja
sr: Kod ciljnog jezika

source: text
hu: szöveg
sr: tekst

source: Format of source text: * `text` - Plain text * `html` - HTML markup
hu: Formátum forrás szöveg: * `text' - egyszerű szöveg * `html' - HTML markup
sr: Format izvornog teksta: * `text` - običan tekst * `html` - HTML markup

source: Preferred number of alternative translations
hu: Előnyös számú alternatív fordítás

source: API key
hu: API kulcs
sr: API ključ

source: Translate file from a language to another
hu: Fájl fordítása egy nyelvről egy másikra
sr: Prevedite fajl sa jednog jezika na drugi

source: Translated file
hu: Fordított fájl
sr: Prevedeni fajl

source: File to translate
hu: Fájl fordítása
sr: Fajl za prevod

source: Detect the language of a single text
hu: A szöveg nyelvének észlelése
sr: Detektuj jezik u tekstu

source: Detections
hu: Észlelések
sr: Detekcija

source: Detection error
hu: Detection hiba
sr: Greška u detekciji

source: Text to detect
hu: Felismerendő szöveg
sr: Tekst za detekciju

source: Retrieve frontend specific settings
hu: Visszakeresni a frontend specifikus beállításokat
sr: Preuzmi specifična podešavanja frontenda

source: frontend settings
hu: frontend beállítások
sr: podešavanja frontenda

source: Submit a suggestion to improve a translation
hu: Küldjön javaslatot a fordítés javításához
sr: Pošaljite predlog za poboljšanje prevoda

source: Success
hu: Siker
sr: Uspešno

source: Not authorized
hu: Nem engedélyezett
sr: Nije dozvoljeno

source: Original text
hu: Eredeti szöveg
sr: Originalni tekst

source: Suggested translation
hu: Javasolt fordítás
sr: Predloženi prevod

source: Language of original text
hu: Eredeti szöveg nyelve
sr: Jezik originalnog teksta

source: Language of suggested translation
hu: A javasolt fordítás nyelve
sr: Jezik predloženog prevoda

source: feedback
hu: visszajelzés
sr: zaključak

source: Language code
hu: Nyelvkód
sr: Jezik koda

source: Human-readable language name (in English)
hu: Emberi olvasható nyelv neve (angolul)
sr: Ime jezika (na engleskom)

source: Supported target language codes
hu: Támogatott célnyelvi kódok
sr: Podržani kodovi ciljnog jezika

source: Translated text(s)
hu: Fordított szöveg(ek)
sr: Prevedeni tekst(ovi)

source: Error message
hu: Hibaüzenet
sr: Poruka o grešci

source: Reason for slow down
hu: A lelassulás oka
sr: Razlog za usporavanje

source: Translated file url
hu: Fordított fájl url
sr: URL prevedenog fajla

source: Confidence value
hu: Bizalmi érték
sr: Nivo poverenja

source: Character input limit for this language (-1 indicates no limit)
hu: Jellemző bemeneti határértéke ennek a nyelvnek (-1 nem jelzi a határt)
sr: Ograničenje unosa znakova za ovaj jezik (-1 označava da nema ograničenja)

source: Frontend translation timeout
hu: Frontend fordítás időtúllépés
sr: Vremensko ograničenje za prevod na frontendu

source: Whether the API key database is enabled.
hu: Függetlenül attól, hogy az API kulcs adatbázisa engedélyezett-e.
sr: Da li je omogućena baza podataka API ključeva.

source: Whether an API key is required.
hu: Szükséges-e API kulcs.
sr: Kada je potreban API ključ.

source: Whether submitting suggestions is enabled.
hu: Ha javaslatok benyújtásá engedélyezett.
sr: Kada je slanje predloga omogućeno.

source: Supported files format
hu: Támogatott fájlformátum
sr: Podržani format fajlova

source: Whether submission was successful
hu: Amennyiben a beküldsé sikeres volt
sr: Da li je podnošenje bilo uspešno

source: Copy text
hu: Szöveg másolása
sr: Kopiraj teks

source: Cannot load %(url)s
hu: Nem tölthető be a(z) %(url)s
sr: Nije moguće učitati %(url)s

source: Unknown error
hu: Ismeretlen hiba
sr: Nepoznata greška

source: Copied
hu: Másolva
sr: Kopirano

source: Thanks for your correction. Note the suggestion will not take effect right away.
hu: Köszönöm a korrekciót. Vegye figyelembe, hogy a javaslata nem fog azonnal hatályba lépni.
sr: Hvala na ispravci. Imajte na umu da predlog neće odmah stupiti na snagu.

source: No languages available. Did you install the models correctly?
hu: Nincsenek elérhető nyelvek. Helyesen telepítette a modelleket?
sr: Nema dostupnih jezika. Da li ste pravilno instalirali modele?

source: Type in your API Key. If you need an API key, %(instructions)s
hu: Írja be az API kulcsot. Ha szüksége van egy API kulcsra, %(instructions)s
sr: Unesite svoj API ključ. Ako vam je potreban API ključ,%(instructions)s

source: press the "Get API Key" link.
hu: nyomja meg a "Get API Key" linket.
sr: kliknite na „Preuzmi API ključ“.

source: contact the server operator.
hu: lépjen kapcsolatba a szerver-üzemeltetővel.
sr: kontaktirajte administratora servera.

source: Free and Open Source Machine Translation API
hu: Ingyenes és nyílt forráskódú gépi fordító API
sr: Besplatni API za mašinsko prevođenje otvorenog koda

source: Free and Open Source Machine Translation API. Self-hosted, offline capable and easy to setup. Run your own API server in just a few minutes.
hu: Ingyenes és nyílt forráskódú gépi fordító API. Helyileg telepített, offline működő és könnyen telepíthető. Futtassa saját API szerverét néhány perc alatt.
sr: Besplatni API za mašinsko prevođenje otvorenog koda. Hostovan na vašem serveru, lokalna verzija i jednostavan za podešavanje. Pokrenite sopstveni API server za samo nekoliko minuta.

source: translation
hu: fordítás
sr: prevod

source: API Docs
hu: API Dokumentáció
sr: API dokumentacija

source: Get API Key
hu: Szerezzen API kucsot
sr: Nabavite API ključ

source: Set API Key
hu: Állítsa be az API kulcsot
sr: Kreiraj API ključ

source: Change language
hu: Nyelv módosítása
sr: Promeni jezik

source: Edit
hu: Szerkesztés
sr: Izmeni

source: Toggle dark/light mode
hu: Váltás sötét/világos módra

source: Dismiss
hu: elvetés
sr: Odbaci

source: Translation API
hu: Fordító API
sr: API za prevođenje

source: Translate Text
hu: Szöveg Fordítása
sr: Prevedi Tekst

source: Translate Files
hu: File-ok fordítása
sr: Prevedi Fajl

source: Translate from
hu: Fordítási ürlap
sr: Prevedi iz

source: Swap source and target languages
hu: Forrás és célnyelv felcserélése
sr: Zamenite izvorni i ciljni jezik

source: Translate into
hu: Fordítsd le ebbe
sr: Prevesti u

source: Text to translate
hu: Fordítandó szöveg
sr: Tekst za prevod

source: Delete text
hu: szöveg törlése
sr: Izbriši tekst

source: Suggest translation
hu: Javasolj fordítást
sr: Predloži prevod

source: Cancel
hu: mégse
sr: Otkaži

source: Send
hu: Küldés
sr: Pošalji

source: Supported file formats:
hu: Támogatott fájlformátumok:
sr: Podržani formati fajlova:

source: Remove file
hu: File eltávolítása
sr: Izbriši fajl

source: Translate
hu: Fordítás
sr: Prevedi

source: Download
hu: Letöltés
sr: Preuzmi

source: Request
hu: Kérés
sr: Zahtev

source: Response
hu: Válasz
sr: Odgovor

source: Open Source Machine Translation API
hu: Nyilt Forráskódú Gépi Fordító API
sr: API za prevođenje otvorenog koda

source: Self-Hosted. Offline Capable. Easy to Setup.
hu: Helyben futtatható, offline működő. Könnyen beállítható.
sr: Hostujte sami. Radi i bez nternet konekcije. Laka instalacija.

source: License:
hu: Licenc:
sr: Licenca:

source: Made with %(heart)s by %(contributors)s and powered by %(engine)s
hu: %(heart)s-el készítve. Közreműködtek %(contributors)s működtetve ezzel: %(engine)s
sr: Napravljen sa %(heart)s, sa %(contributors)s , i pokreće ga %(engine)s

source: %(libretranslate)s Contributors
hu: %(libretranslate)s Közreműködők
sr: %(libretranslate)s Saradnici

source: Hindi
sr: Indijski

source: File
sr: Fajl

source: LibreTranslate
sr: SlobodniPrevodilac
